saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.LM3S_DFP.1.1.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>LM3S_DFP</name>
  <description>Texas Instruments LM3S Series Device Support</description>

  <releases>
    <release version="1.1.0" date="2015-09-30">
      Corrected RAM settings.
    </release>
    <release version="1.0.0">
      First Release version of TI LM3S Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Texas Instruments</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package TI LM3S</keyword>
    <keyword>LM3S</keyword>
  </keywords>

  <devices>
    <family Dfamily="LM3S Series" Dvendor="Texas Instruments:16">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
      <book name="Documents\dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
TI's LM3S Series is a digital signal controller for embedded applications requiring a high level of integration and low power dissipation.
Typical applications include Point-of-sale terminals, web servers, multi-protocol bridges, Automation controllers, application control, robotics control, Audio, MP3 decoderscar alarms, GPS/fleet monitors

  - LCD Controller (1024x768x24) for STN and TFT
  - CRC Engine
  - Event Recorder
  - Quad SPI Flash interface (SPIFI)
  - Motor control PWM for three-phase motor
  - Unique ID for each device
      </description>

      <feature type="RTC"           n="1"/>
      <feature type="Temp"          n="-40"     m="85"/>

      <!-- ************************  Subfamily 'LM3S1xx'  **************************** -->
      <subFamily DsubFamily="LM3S1xx">
        <feature type="WDT"           n="1"/>
        <feature type="UART"          n="1"       m="10000000"/>
        <feature type="SPI"           n="1"/>
        <feature type="IOs"           n="18"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="QFP"           n="48"/>
      
        <!-- *************************  Device 'LM3S101'  ***************************** -->
        <device Dname="LM3S101">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device\Include\lm3s101.h" define="LM3S101"/>
          <debug svd="SVD\lm3s101.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_8.FLM"   start="0x00000000" size="0x00002000"             default="1"/>
  
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S101&amp;fileType=pdf" title="LM3S101 Datasheet"/>
  
          <feature type="Timer"         n="1"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
        </device>
        
        <!-- *************************  Device 'LM3S102'  ***************************** -->
        <device Dname="LM3S102">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device\Include\lm3s102.h" define="LM3S102"/>
          <debug svd="SVD\lm3s102.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_8.FLM"   start="0x00000000" size="0x00002000"             default="1"/>
  
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S102&amp;fileType=pdf" title="LM3S102 Datasheet"/>
  
          <feature type="Timer"         n="2"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="1"                           name="Analog Comparator"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LM3S3xx'  **************************** -->
      <subFamily DsubFamily="LM3S3xx">
        <feature type="WDT"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="QFP"           n="48"/>
      
        <!-- *************************  Device 'LM3S300'  ***************************** -->
        <device Dname="LM3S300">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="25000000"/>
          <compile header="Device\Include\lm3s300.h" define="LM3S300"/>
          <debug svd="SVD\lm3s300.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>
  
          <book name="http://www.ti.com/general/docs/lit/getliterature.tsp?genericPartNumber=LM3S300&amp;fileType=pdf" title="LM3S300 Datasheet"/>
  
          <feature type="Timer"         n="6"       m="32"              name="Capture / Compare / PWM (CCP)"/>
          <feature type="UART"          n="2"       m="10000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="AnalogOther"   n="3"                           name="Analog Comparator"/>
          <feature type="IOs"           n="36"/>
        </device>
        
        <!-- *************************  Device 'LM3S301'  ***************************** -->
        <device Dname="LM3S301">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="20000000"/>
          <compile header="Device\Include\lm3s301.h" define="LM3S301"/>
          <debug svd="SVD\lm3s301.svd"/>
          <memory id="IROM1"                   start="0x00000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                   start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash\LM3S_16.FLM"  start="0x00000000" size="0x00004000"             default="1"/>

